01Hub/fbedit/ShowMap/STM32_Sonar/main.c
/*******************************************************************************
* Function Name  : GetADCValue
* Description    : This function sums 16 ADC conversions and returns the average.
* Input          : ADC channel
* Output         : None
* Return         : The ADC cannel reading
*******************************************************************************/
u16 GetADCValue(u8 Channel)
{
  vu8 i;
  vu16 ADCValue;
  ADC_InitTypeDef ADC_InitStructure;

  ADCValue = 0;
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);
  /* ADC1 regular channel configuration */ 
  ADC_RegularChannelConfig(ADC1, Channel, 1, ADC_SampleTime_239Cycles5);
  /* Start ADC1 Software Conversion */ 
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
  /* Add 16 conversions to reduce thermal noise */
  i = 16;
  while (i--)
  {
    ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
    {
    }
    ADCValue = ADCValue + ADC1->DR;
  }
  /* Stop ADC1 Software Conversion */ 
  ADC_SoftwareStartConvCmd(ADC1, DISABLE);
  /* Return average of the 16 added conversions */
  return (ADCValue >> 4);
}

/*******************************************************************************
* Function Name  : GainSetup
* Description    : This function sets up the gain levels for each pixel
* Input          : Zero terminated string
* Output         : None
* Return         : None
*******************************************************************************/
void GainSetup(void)
{
  vu32 GainInitPtr;
  vu32 i;
  vu32 GainPtr;
  vu32 GainInc;
  vu32 GainVal;
  GainInitPtr=1;
  GainPtr=0;
  GainVal=0;
  while (GainInitPtr<17)
  {
    GainVal=STM32_Sonar.GainInit[GainInitPtr]<<13;
    GainInc=(STM32_Sonar.GainInit[GainInitPtr+1]-STM32_Sonar.GainInit[GainInitPtr])<<8;
    i=0;
    while (i<32)
    {
      STM32_Sonar.GainArray[GainPtr]=(GainVal>>13)+STM32_Sonar.GainInit[0];
      if ((GainVal>>12) && 1)
      {
        STM32_Sonar.GainArray[GainPtr]++;
      }
      if (STM32_Sonar.GainArray[GainPtr]>4095)
      {
        STM32_Sonar.GainArray[GainPtr]=4095;
      }
      GainVal+=GainInc;
      GainPtr++;
      i++;
    }
    GainInitPtr++;
  }
}

/*******************************************************************************
* Function Name  : TIM1_UP_IRQHandler
* Description    : This function handles TIM1 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_UP_IRQHandler(void)
{
  /* Set ping outputs high (FET's off) */
  GPIO_WriteBit(GPIOA, GPIO_Pin_2 | GPIO_Pin_1, Bit_SET);
  /* Clear TIM1 Update interrupt pending bit */
  TIM1->SR = (u16)~TIM_IT_Update;
  if (STM32_Sonar.PingPulses)
  {
    GPIO_Write(GPIOA,Ping);
    if (Ping == 0x2)
    {
      Ping = 0x4;     // PA02
    }
    else
    {
      Ping = 0x2;     // PA01
      STM32_Sonar.PingPulses--;
    }
  }
  else
  {
    /* Ping done, Disable TIM1 */
    TIM_Cmd(TIM1, DISABLE);
    /* Enable ADC injected channel */
    ADC_AutoInjectedConvCmd(ADC1, ENABLE);
    /* TIM2 configuration */
    TIM2_Configuration();
    /* Enable TIM2 */
    TIM_Cmd(TIM2, ENABLE);
  }
}

/*******************************************************************************
* Function Name  : TIM2_IRQHandler
* Description    : This function handles TIM2 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM2_IRQHandler(void)
{
  /* Clear TIM2 Update interrupt pending bit */
  asm("mov    r0,#0x40000000");               /* TIM2 */
  asm("strh   r0,[r0,#0x8 *2]");              /* TIM2->SR */

  /* Increment the echo array index */
  asm("mov    r1,#0x20000000");               /* STM32_Sonar */
  asm("ldrh   r2,[r1,#0x6]");                 /* STM32_Sonar.EchoIndex */
  asm("add    r2,r2,#0x1");
  asm("cmp    r2,#0x200");
  asm("ite    ne");
  asm("strhne r2,[r1,#0x6]");                 /* STM32_Sonar.EchoIndex */
  asm("strbeq r2,[r1,#0x0]");                 /* STM32_Sonar.Start */

  /* Update the DAC to output next gain level */
  asm("movw   r0,#0x7400");                   /* DAC1 */
  asm("movt   r0,#0x4000");
  asm("add    r2,r2,0x108");
  asm("ldrh   r3,[r1,r2,lsl #0x1]");
  asm("strh   r3,[r0,#0x8]");                 /* DAC_DHR12R1 */
}

/*******************************************************************************
* Function Name  : TIM3_IRQHandler
* Description    : This function handles TIM3 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM3_IRQHandler(void)
{
  /* Clear TIM3 Update interrupt pending bit */
  TIM3->SR = (u16)~TIM_IT_Update;
  if (GPIO_ReadOutputDataBit(GPIOC,GPIO_Pin_4))
  {
    GPIO_ResetBits(GPIOC,GPIO_Pin_4);
  }
  else
  {
    GPIO_SetBits(GPIOC,GPIO_Pin_4);
  }
}

/*******************************************************************************
* Function Name  : rs232_putc
* Description    : This function transmits a character
* Input          : Character
* Output         : None
* Return         : None
*******************************************************************************/
void rs232_putc(char c)
{
  /* Transmit Data */
  USART1->DR = (u16)c;
  /* Wait until transmit register empty*/
  while((USART1->SR & USART_FLAG_TXE) == 0);          
}

