01Hub/fbedit/ShowMap/STM32_Sonar/main.c
/*******************************************************************************
* Function Name  : rs232_puts
* Description    : This function transmits a zero terminated string
* Input          : Zero terminated string
* Output         : None
* Return         : None
*******************************************************************************/
void rs232_puts(char *str)
{
  char c;
  /* Characters are transmitted one at a time. */
  while ((c = *str++))
  {
    rs232_putc(c);
  }
}

/*******************************************************************************
* Function Name  : USART1_IRQHandler
* Description    : This function handles USART1 Receive interrupt request
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART1_IRQHandler(void)
{
  /* receive GPS data from the serial port */
  vu8 c;
  c=USART1->DR;
  USART1->SR = (u16)~USART_FLAG_RXNE;
  STM32_Sonar.GPSArray[STM32_Sonar.GPSPtr++]=c;
  if (STM32_Sonar.Setup)
  {
    if (c==0xA)
    {
      if (STM32_Sonar.nGSV)
      {
        STM32_Sonar.nGSV--;
      }
      else
      {
        /* Get number of GSV messages - 1 */
        STM32_Sonar.nGSV=(STM32_Sonar.GPSArray[7] & 0x3)-1;
      }
      if (!STM32_Sonar.nGSV)
      {
        STM32_Sonar.GPSArray[STM32_Sonar.GPSPtr]=0;
        STM32_Sonar.GPSPtr=0;
        STM32_Sonar.GPSCounter++;
      }
    }
  }
  else
  {
    /* Check if char is LF */
    if (c==0xA)
    {
      STM32_Sonar.GPSArray[STM32_Sonar.GPSPtr]=0;
      STM32_Sonar.GPSPtr=0;
      STM32_Sonar.GPSCounter++;
    }
  }

  // /* Get the 8 bit character */
  // asm("movw   r0,#0x3800");                   /* Get pointer to USART1 */
  // asm("movt   r0,#0x4001");
  // asm("ldrh   r12,[r0,#0x4]");                /* USART1->DR */
  // asm("uxtb   r12,r12");                      /* Convert to 8 bit */

  // /* Reset the RX Status */
  // asm("movw   r3,#0xFFDF");                   /* Reset RX status */
  // asm("strh   r3,[r0,#0x0]");                 /* Store USART1->SR */

  // /* Store the byte in the GPSArray */
  // asm("movw   r1,#0x0610");                   /* Get pointer to GPSArray */
  // asm("movt   r1,#0x2000");
  // asm("movw   r2,#0x0100");                   /* Get offset to GPSPtr */
  // asm("ldrb   r3,[r1,r2]");                   /* Get GPSPtr */
  // asm("strb   r12,[r1,r3]");                  /* Store GPSArray[GPSPtr] */

  // /* Increment the GPSPtr */
  // asm("add    r3,r3,#0x1");                   /* Increment GPSPtr */
  // asm("strb   r3,[r1,r2]");                   /* Store GPSPtr */

  // /* Check for end of message (LF character) */
  // asm("cmp    r12,#0xA");                     /* LF */
  // asm("bne    ex");                           /* Not LF, Exit */

  // /* Zero terminate */
  // asm("mov    r2,#0x0");                      /* 0 */
  // asm("strb   r2,[r1,r3]");                  /* Store GPSArray[GPSPtr] */

  // /* Reset GPSPtr */
  // asm("strb   r2,[r1,r2]");                   /* Store GPSPtr */

  // /* Increment the GPSCounter to signal that a new message is ready */
  // asm("mov    r1,#0x20000000");               /* STM32_Sonar */
  // asm("ldrh   r3,[r1,#0xE]");                 /* Get GPSCounter */
  // asm("add    r3,r3,#0x1");                   /* Increment GPSCounter */
  // asm("strh   r3,[r1,#0xE]");                 /* Store GPSCounter */
  // asm("ex:");                                 /* Done */

}

/*******************************************************************************
* Function Name  : ADC_Startup
* Description    : This function calibrates ADC1.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void ADC_Startup(void)
{
  ADC_InitTypeDef ADC_InitStructure;
  /* ADCCLK = PCLK2/2 */
  RCC_ADCCLKConfig(RCC_PCLK2_Div2);
  /* ADC1 configuration ------------------------------------------------------*/
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);
  /* ADC1 regular channel2 configuration */ 
  ADC_RegularChannelConfig(ADC1, ADC_Channel_3, 1, ADC_SampleTime_55Cycles5);
  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);
  /* Enable ADC1 reset calibaration register */   
  ADC_ResetCalibration(ADC1);
  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC1));
  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC1);
  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC1));
}

/*******************************************************************************
* Function Name  : ADC_Configuration
* Description    : This function prepares ADC1 for Injected conversion
*                  on channel 2.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void ADC_Configuration(void)
{
  ADC_InitTypeDef ADC_InitStructure;

  /* ADCCLK = PCLK2/2 */
  RCC_ADCCLKConfig(RCC_PCLK2_Div2);
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  /* ADC1 single channel configuration */
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);
  /* Setup injected channel */
  ADC_InjectedSequencerLengthConfig(ADC1,1);
  /* Sonar echo */
  ADC_InjectedChannelConfig(ADC1,ADC_Channel_3,1,ADC_SampleTime_1Cycles5);
}

